# Случайная непрерывная величина A имеет равномерное распределение на промежутке (200, 800].
# Найдите ее среднее значение и дисперсию.

a = 200
b = 800
m_srednee = (a + b) / 2
d_dispersiya = (b - a) ** 2 / 12
print(f'среднее значение {m_srednee}')
print(f'дисперсия  {d_dispersiya}')
"""
среднее значение 500.0
дисперсия  30000.0
"""